; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph1 - mode
	image0 - mode
	infrared3 - mode
	infrared4 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	Star22 - direction
	Star7 - direction
	Star33 - direction
	Star39 - direction
	GroundStation36 - direction
	GroundStation20 - direction
	Star38 - direction
	GroundStation37 - direction
	GroundStation9 - direction
	Star19 - direction
	Star15 - direction
	GroundStation11 - direction
	Star31 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation34 - direction
	GroundStation27 - direction
	Star16 - direction
	Star25 - direction
	Star30 - direction
	GroundStation1 - direction
	GroundStation28 - direction
	Star17 - direction
	GroundStation18 - direction
	GroundStation24 - direction
	Star29 - direction
	GroundStation26 - direction
	Star12 - direction
	Star14 - direction
	Star21 - direction
	Star35 - direction
	Star23 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	GroundStation5 - direction
	Star32 - direction
	Star13 - direction
	Star3 - direction
	GroundStation10 - direction
	Phenomenon40 - direction
	Planet41 - direction
	Planet42 - direction
	Star43 - direction
	Planet44 - direction
	Planet45 - direction
	Phenomenon46 - direction
	Planet47 - direction
	Planet48 - direction
	Planet49 - direction
	Phenomenon50 - direction
	Planet51 - direction
	Phenomenon52 - direction
	Planet53 - direction
	Star54 - direction
	Planet55 - direction
	Planet56 - direction
	Planet57 - direction
	Planet58 - direction
	Phenomenon59 - direction
	Planet60 - direction
	Planet61 - direction
	Star62 - direction
	Phenomenon63 - direction
	Star64 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared4)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation9)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared3)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star17)
	(calibration_target instrument1 GroundStation27)
	(calibration_target instrument1 Star33)
	(calibration_target instrument1 Star15)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation10)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star22)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation20)
	(supports instrument3 image0)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 Star39)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 GroundStation20)
	(calibration_target instrument3 Star33)
	(calibration_target instrument3 GroundStation18)
	(calibration_target instrument3 GroundStation37)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star35)
	(calibration_target instrument4 GroundStation36)
	(calibration_target instrument4 Star31)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star21)
	(calibration_target instrument4 GroundStation28)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 GroundStation10)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star19)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 GroundStation37)
	(calibration_target instrument5 Star15)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 Star21)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 Star25)
	(calibration_target instrument5 Star38)
	(calibration_target instrument5 GroundStation20)
	(supports instrument6 infrared4)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation26)
	(calibration_target instrument6 Star31)
	(calibration_target instrument6 GroundStation11)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 Star15)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation27)
	(supports instrument7 image0)
	(supports instrument7 infrared3)
	(supports instrument7 infrared4)
	(calibration_target instrument7 Star14)
	(calibration_target instrument7 Star23)
	(calibration_target instrument7 Star12)
	(calibration_target instrument7 Star25)
	(calibration_target instrument7 Star30)
	(calibration_target instrument7 GroundStation26)
	(calibration_target instrument7 Star16)
	(calibration_target instrument7 GroundStation27)
	(calibration_target instrument7 GroundStation34)
	(calibration_target instrument7 Star4)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 GroundStation1)
	(calibration_target instrument8 Star30)
	(calibration_target instrument8 Star14)
	(supports instrument9 thermograph1)
	(supports instrument9 image0)
	(calibration_target instrument9 Star14)
	(calibration_target instrument9 Star35)
	(calibration_target instrument9 Star12)
	(calibration_target instrument9 GroundStation26)
	(calibration_target instrument9 Star21)
	(calibration_target instrument9 Star29)
	(calibration_target instrument9 GroundStation24)
	(calibration_target instrument9 GroundStation18)
	(calibration_target instrument9 Star17)
	(calibration_target instrument9 GroundStation28)
	(supports instrument10 thermograph1)
	(supports instrument10 spectrograph2)
	(supports instrument10 image0)
	(calibration_target instrument10 GroundStation10)
	(calibration_target instrument10 Star3)
	(calibration_target instrument10 Star13)
	(calibration_target instrument10 Star32)
	(calibration_target instrument10 GroundStation5)
	(calibration_target instrument10 GroundStation8)
	(calibration_target instrument10 GroundStation6)
	(calibration_target instrument10 Star23)
	(calibration_target instrument10 Star35)
	(calibration_target instrument10 Star21)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet60)
)
(:goal (and
	(pointing satellite1 GroundStation36)
	(have_image Phenomenon40 infrared4)
	(have_image Planet41 infrared4)
	(have_image Planet42 image0)
	(have_image Star43 thermograph1)
	(have_image Planet44 spectrograph2)
	(have_image Planet45 spectrograph2)
	(have_image Phenomenon46 infrared4)
	(have_image Planet47 spectrograph2)
	(have_image Planet48 image0)
	(have_image Planet49 infrared3)
	(have_image Phenomenon50 infrared3)
	(have_image Planet51 spectrograph2)
	(have_image Phenomenon52 infrared4)
	(have_image Planet53 infrared3)
	(have_image Star54 thermograph1)
	(have_image Planet55 image0)
	(have_image Planet56 infrared4)
	(have_image Planet57 thermograph1)
	(have_image Planet58 spectrograph2)
	(have_image Phenomenon59 infrared3)
	(have_image Planet60 image0)
	(have_image Planet61 spectrograph2)
	(have_image Star62 infrared4)
	(have_image Phenomenon63 infrared3)
	(have_image Star64 infrared3)
))

)

; plan
1. (switch_on instrument10 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument10)
   goals met: 0 of 26
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 26
3. (turn_to satellite1 groundstation36 groundstation20)
   deleted: (pointing satellite1 groundstation20)
   added: (pointing satellite1 groundstation36)
   goals met: 1 of 26
4. (turn_to satellite0 phenomenon40 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon40)
   goals met: 1 of 26
5. (turn_to satellite3 star35 planet60)
   deleted: (pointing satellite3 planet60)
   added: (pointing satellite3 star35)
   goals met: 1 of 26
6. (calibrate satellite3 instrument10 star35)
   added: (calibrated instrument10)
   goals met: 1 of 26
7. (turn_to satellite3 planet42 star35)
   deleted: (pointing satellite3 star35)
   added: (pointing satellite3 planet42)
   goals met: 1 of 26
8. (take_image satellite3 planet42 instrument10 image0)
   added: (have_image planet42 image0)
   goals met: 2 of 26
9. (turn_to satellite3 planet44 planet42)
   deleted: (pointing satellite3 planet42)
   added: (pointing satellite3 planet44)
   goals met: 2 of 26
10. (take_image satellite3 planet44 instrument10 spectrograph2)
   added: (have_image planet44 spectrograph2)
   goals met: 3 of 26
11. (turn_to satellite3 planet45 planet44)
   deleted: (pointing satellite3 planet44)
   added: (pointing satellite3 planet45)
   goals met: 3 of 26
12. (take_image satellite3 planet45 instrument10 spectrograph2)
   added: (have_image planet45 spectrograph2)
   goals met: 4 of 26
13. (turn_to satellite3 planet47 planet45)
   deleted: (pointing satellite3 planet45)
   added: (pointing satellite3 planet47)
   goals met: 4 of 26
14. (take_image satellite3 planet47 instrument10 spectrograph2)
   added: (have_image planet47 spectrograph2)
   goals met: 5 of 26
15. (turn_to satellite3 planet48 planet47)
   deleted: (pointing satellite3 planet47)
   added: (pointing satellite3 planet48)
   goals met: 5 of 26
16. (take_image satellite3 planet48 instrument10 image0)
   added: (have_image planet48 image0)
   goals met: 6 of 26
17. (turn_to satellite3 planet51 planet48)
   deleted: (pointing satellite3 planet48)
   added: (pointing satellite3 planet51)
   goals met: 6 of 26
18. (take_image satellite3 planet51 instrument10 spectrograph2)
   added: (have_image planet51 spectrograph2)
   goals met: 7 of 26
19. (turn_to satellite3 planet55 planet51)
   deleted: (pointing satellite3 planet51)
   added: (pointing satellite3 planet55)
   goals met: 7 of 26
20. (take_image satellite3 planet55 instrument10 image0)
   added: (have_image planet55 image0)
   goals met: 8 of 26
21. (turn_to satellite3 planet57 planet55)
   deleted: (pointing satellite3 planet55)
   added: (pointing satellite3 planet57)
   goals met: 8 of 26
22. (take_image satellite3 planet57 instrument10 thermograph1)
   added: (have_image planet57 thermograph1)
   goals met: 9 of 26
23. (turn_to satellite3 planet58 planet57)
   deleted: (pointing satellite3 planet57)
   added: (pointing satellite3 planet58)
   goals met: 9 of 26
24. (take_image satellite3 planet58 instrument10 spectrograph2)
   added: (have_image planet58 spectrograph2)
   goals met: 10 of 26
25. (turn_to satellite3 planet60 planet58)
   deleted: (pointing satellite3 planet58)
   added: (pointing satellite3 planet60)
   goals met: 10 of 26
26. (take_image satellite3 planet60 instrument10 image0)
   added: (have_image planet60 image0)
   goals met: 11 of 26
27. (turn_to satellite3 planet61 planet60)
   deleted: (pointing satellite3 planet60)
   added: (pointing satellite3 planet61)
   goals met: 11 of 26
28. (take_image satellite3 planet61 instrument10 spectrograph2)
   added: (have_image planet61 spectrograph2)
   goals met: 12 of 26
29. (turn_to satellite3 star43 planet61)
   deleted: (pointing satellite3 planet61)
   added: (pointing satellite3 star43)
   goals met: 12 of 26
30. (take_image satellite3 star43 instrument10 thermograph1)
   added: (have_image star43 thermograph1)
   goals met: 13 of 26
31. (turn_to satellite3 star54 star43)
   deleted: (pointing satellite3 star43)
   added: (pointing satellite3 star54)
   goals met: 13 of 26
32. (take_image satellite3 star54 instrument10 thermograph1)
   added: (have_image star54 thermograph1)
   goals met: 14 of 26
33. (turn_to satellite0 star33 phenomenon40)
   deleted: (pointing satellite0 phenomenon40)
   added: (pointing satellite0 star33)
   goals met: 14 of 26
34. (calibrate satellite0 instrument1 star33)
   added: (calibrated instrument1)
   goals met: 14 of 26
35. (turn_to satellite0 phenomenon40 star33)
   deleted: (pointing satellite0 star33)
   added: (pointing satellite0 phenomenon40)
   goals met: 14 of 26
36. (take_image satellite0 phenomenon40 instrument1 infrared4)
   added: (have_image phenomenon40 infrared4)
   goals met: 15 of 26
37. (turn_to satellite0 phenomenon46 phenomenon40)
   deleted: (pointing satellite0 phenomenon40)
   added: (pointing satellite0 phenomenon46)
   goals met: 15 of 26
38. (take_image satellite0 phenomenon46 instrument1 infrared4)
   added: (have_image phenomenon46 infrared4)
   goals met: 16 of 26
39. (turn_to satellite0 phenomenon50 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 phenomenon50)
   goals met: 16 of 26
40. (take_image satellite0 phenomenon50 instrument1 infrared3)
   added: (have_image phenomenon50 infrared3)
   goals met: 17 of 26
41. (turn_to satellite0 phenomenon52 phenomenon50)
   deleted: (pointing satellite0 phenomenon50)
   added: (pointing satellite0 phenomenon52)
   goals met: 17 of 26
42. (take_image satellite0 phenomenon52 instrument1 infrared4)
   added: (have_image phenomenon52 infrared4)
   goals met: 18 of 26
43. (turn_to satellite0 phenomenon59 phenomenon52)
   deleted: (pointing satellite0 phenomenon52)
   added: (pointing satellite0 phenomenon59)
   goals met: 18 of 26
44. (take_image satellite0 phenomenon59 instrument1 infrared3)
   added: (have_image phenomenon59 infrared3)
   goals met: 19 of 26
45. (turn_to satellite0 phenomenon63 phenomenon59)
   deleted: (pointing satellite0 phenomenon59)
   added: (pointing satellite0 phenomenon63)
   goals met: 19 of 26
46. (take_image satellite0 phenomenon63 instrument1 infrared3)
   added: (have_image phenomenon63 infrared3)
   goals met: 20 of 26
47. (turn_to satellite0 planet41 phenomenon63)
   deleted: (pointing satellite0 phenomenon63)
   added: (pointing satellite0 planet41)
   goals met: 20 of 26
48. (take_image satellite0 planet41 instrument1 infrared4)
   added: (have_image planet41 infrared4)
   goals met: 21 of 26
49. (turn_to satellite0 planet49 planet41)
   deleted: (pointing satellite0 planet41)
   added: (pointing satellite0 planet49)
   goals met: 21 of 26
50. (take_image satellite0 planet49 instrument1 infrared3)
   added: (have_image planet49 infrared3)
   goals met: 22 of 26
51. (turn_to satellite0 planet53 planet49)
   deleted: (pointing satellite0 planet49)
   added: (pointing satellite0 planet53)
   goals met: 22 of 26
52. (take_image satellite0 planet53 instrument1 infrared3)
   added: (have_image planet53 infrared3)
   goals met: 23 of 26
53. (turn_to satellite0 planet56 planet53)
   deleted: (pointing satellite0 planet53)
   added: (pointing satellite0 planet56)
   goals met: 23 of 26
54. (take_image satellite0 planet56 instrument1 infrared4)
   added: (have_image planet56 infrared4)
   goals met: 24 of 26
55. (turn_to satellite0 star62 planet56)
   deleted: (pointing satellite0 planet56)
   added: (pointing satellite0 star62)
   goals met: 24 of 26
56. (take_image satellite0 star62 instrument1 infrared4)
   added: (have_image star62 infrared4)
   goals met: 25 of 26
57. (turn_to satellite0 star64 star62)
   deleted: (pointing satellite0 star62)
   added: (pointing satellite0 star64)
   goals met: 25 of 26
58. (take_image satellite0 star64 instrument1 infrared3)
   added: (have_image star64 infrared3)
   goals met: 26 of 26
